import sympy as sp

ρ, Λ, µ = sp.symbols('ρ Λ µ')
a = sp.Matrix([[ 0, 0, 0, -1/ρ, 0, 0, 0, 0, 0],
              [ 0, 0, 0, 0,-1/ρ, 0, 0, 0, 0],
              [ 0, 0, 0, 0, -1/ρ, 0, 0, 0, 0],
              [-(Λ+2*µ), 0, 0, 0, 0, 0, 0, 0, 0],
              [ 0, 0, -µ, 0, 0, 0, 0, 0, 0],
              [ 0, 0, 0, -µ, 0, 0, 0, 0, 0],
              [-Λ, 0, 0, 0, 0, 0, 0, 0, 0],
              [ 0, 0, 0, 0, 0, 0, 0, 0, 0],
              [-Λ,  0, 0, 0, 0, 0, 0, 0, 0]])

lam = sp.symbols('lambda')
cp = sp.det(a - lam * sp.eye(9))
eigs = sp.roots(sp.Poly(cp, lam))
print("Собственные значения матрицы:")
for i in eigs:
    print(i)


